// 날씨 아이콘 매핑
export const weatherIcons = {
  // 하늘상태
  SKY: {
    '1': '☀️', // 맑음
    '3': '⛅', // 구름많음
    '4': '☁️', // 흐림
  },
  // 강수형태
  PTY: {
    '0': '', // 없음
    '1': '🌧️', // 비
    '2': '🌨️', // 비/눈
    '3': '❄️', // 눈
    '4': '🌦', // 소나기
  },
  // 강수량 범주
  PCP: {
    '0': '', // 강수없음
    '1': '🌦', // 1mm 미만
    '2': '🌧️', // 1.0~29.9mm
    '3': '⛈️', // 30.0~50.0mm
    '4': '🌊', // 50.0mm 이상
  },
  // 적설량 범주
  SNO: {
    '0': '', // 적설없음
    '1': '❄️', // 0.5cm 미만
    '2': '🌨️', // 0.5~4.9cm
    '3': '☃️', // 5.0cm 이상
  }
};

export default weatherIcons; 